Repository: vgezer/translationTools
Catalog: tmx2tbx/terminology.tmx
Source language: en
Languages: tr

source: abort
tr: durdur/iptal et

source: absolute
tr: mutlak

source: abstract
tr: özet

source: accelerator
tr: hızlandırıcı

source: accent
tr: vurgu

source: accept
tr: kabul et

source: access
tr: erişim

source: accessibility
tr: erişebilirlik

source: accessory
tr: donatı

source: account
tr: hesap

source: accuracy
tr: doğruluk

source: acquire
tr: edinmek

source: acronym
tr: kısaltma

source: action
tr: eylem

source: activate
tr: etkinleştir

source: active
tr: etkin

source: activity
tr: etkinlik

source: adapter
tr: bağdaştırıcı

source: add
tr: ekle

source: address
tr: adres

source: adjust
tr: ayarla

source: administration
tr: yönetim

source: administrator
tr: yönetici

source: advanced
tr: gelişmiş

source: agent
tr: aracı

source: agree
tr: kabul etme

source: agreement
tr: anlaşma

source: alert
tr: uyarı

source: algorithm
tr: algoritma

source: alias
tr: rumuz/örtüşen

source: aliasing
tr: rumuzlandırma/örtüşme

source: align
tr: hizala

source: alignment
tr: hizalama

source: allow
tr: izin ver

source: alphanumeric
tr: alfanümerik

source: alternative
tr: diğer

source: amount
tr: miktar

source: analysis
tr: çözümleme

source: anchor
tr: sabitleyici

source: angle
tr: açı

source: animate
tr: canlandır

source: animation
tr: canlandırma

source: announce
tr: duyurma

source: announcement
tr: duyuru

source: anonymous
tr: anonim

source: anti-aliasing
tr: örtüşme önleme

source: anti virus
tr: anti virüs

source: appear
tr: belirme

source: append
tr: ekle

source: applet
tr: uygulama programı

source: application
tr: uygulama

source: apply
tr: uygula

source: approval
tr: onay

source: approve
tr: onayla

source: approximate
tr: benzeştirme

source: arbitrary
tr: gelişigüzel

source: archive
tr: arşiv

source: area
tr: alan

source: argument
tr: bağımsız değişken

source: arrangement
tr: sıralama, düzenleme, diziliş,

source: arrow
tr: ok

source: article
tr: madde

source: ascending
tr: artan

source: aspect
tr: en-boy

source: assign
tr: ata

source: assignment
tr: atama

source: asynchronous
tr: eşzamansız

source: attach
tr: ekle

source: attachment
tr: ek

source: attempt
tr: girişim

source: attribute
tr: öznitelik

source: audio
tr: ses

source: authenticate
tr: doğrula

source: authentication
tr: kimlik doğrulama

source: authorization
tr: yetkilendirme

source: authorize
tr: yetkilendir

source: auto
tr: otomatik

source: automatic
tr: otomatik

source: availability
tr: kullanırlık

source: available
tr: kullanılabilir

source: average
tr: ortalama

source: axis
tr: eksen

source: backbone
tr: omurga

source: back-end
tr: art alanda çalışan uygulama

source: background
tr: arkaplan

source: backup
tr: yedekleme

source: bandwidth
tr: bant genişliği

source: banner
tr: afiş

source: bar
tr: çubuk

source: base
tr: taban

source: beep
tr: bip

source: begin
tr: başla

source: behavior
tr: davranış

source: binary
tr: ikili değer

source: bind
tr: bağla

source: bitmap
tr: bit eşlem

source: blank
tr: boş

source: blink
tr: yanıp sönme

source: block (unit)
tr: blok (birim)

source: block (verb)
tr: bloke et (eylem)

source: blur
tr: bulanıklaştır

source: board
tr: pano

source: body
tr: gövde

source: bold
tr: kalın

source: bookmarks
tr: yer imleri

source: boot
tr: ön yükleme

source: border
tr: kenarlık

source: box
tr: kutu

source: bracket
tr: köşeli ayraç

source: branch
tr: alt grup

source: break
tr: kes

source: break (program)
tr: durdur (program)

source: break point
tr: durdurma noktası

source: bridge (verb)
tr: köprüle (eylem)

source: bridge (noun)
tr: köprü (isim)

source: broken
tr: bozuk

source: browse
tr: gözat

source: browser
tr: tarayıcı

source: buffer
tr: tampon / tampon bellek

source: bug
tr: hata

source: build
tr: oluştur

source: built-in
tr: yerleşik

source: bullet
tr: madde imi

source: bus
tr: veri yolu

source: button
tr: düğme

source: byte
tr: bayt

source: cable
tr: kablo

source: cache
tr: ön bellek

source: calculate
tr: hesapla

source: calculator
tr: hesap makinesi

source: calendar
tr: takvim

source: call
tr: çağrı

source: camera
tr: kamera

source: cancel
tr: iptal et

source: capability
tr: yetenek

source: capacity
tr: kapasite

source: caption
tr: resim yazısı, alt yazı, başlık

source: capture
tr: yakala

source: card
tr: kart

source: case
tr: durum

source: case (font)
tr: büyük/küçük harf (yazı tipi)

source: catalog
tr: katalog

source: category
tr: sınıflandırma

source: cell
tr: hücre

source: certificate
tr: sertifika

source: certify
tr: onayla

source: change
tr: değiştir

source: channel
tr: kanal

source: character
tr: karakter

source: charset
tr: karakter kümesi

source: chart
tr: çizelge, grafik

source: chat
tr: sohbet

source: check
tr: kontrol et

source: check box
tr: onay kutusu

source: child
tr: alt

source: choice
tr: seçim

source: choose
tr: seç

source: class
tr: sınıf

source: classic
tr: klasik

source: classify
tr: sınıflandır

source: clean
tr: temiz

source: clear
tr: sil

source: click (noun)
tr: tıklama sesi (isim)

source: click (verb)
tr: tıklama (eylem)

source: client
tr: istemci

source: clip art
tr: hazır resim

source: clip board
tr: geçici taşıma panosu

source: clock
tr: saat

source: close
tr: kapat

source: code (program)
tr: kod (program komutları)

source: code (symbol)
tr: kod simgesi (simgeler)

source: codec
tr: kodlayıcı-kod çözücü

source: collapse
tr: daralt

source: collect
tr: topla

source: column
tr: sütun

source: combination
tr: katışım

source: comma
tr: virgül

source: command
tr: komut

source: comment
tr: açıklama

source: common
tr: yaygın

source: communication
tr: iletişim

source: compact
tr: sıkıştır

source: compare
tr: kıyasla

source: compatibility
tr: uyumluluk

source: compatible
tr: uyumlu

source: compilation
tr: derleme

source: compile
tr: derle

source: compiler
tr: derleyici

source: complete
tr: tamamla

source: component
tr: bileşen

source: compose
tr: oluştur

source: composition
tr: dizgi

source: compress
tr: sıkıştır

source: compression
tr: sıkıştırma

source: computer
tr: bilgisayar

source: computing
tr: bilgi işleme

source: concatenate
tr: ulamak

source: concurrent
tr: eşzamanlı erişim

source: condense
tr: yoğun

source: condition
tr: durum

source: configuration
tr: yapılandırma

source: configure
tr: yapılandır

source: confirm
tr: onayla

source: confirmation
tr: onaylama

source: conflict
tr: çatışma

source: connect
tr: bağlan

source: connection
tr: bağlantı

source: console
tr: konsol

source: contact (noun)
tr: bağlantı (isim)

source: contact (verb)
tr: bağlantı kur (eylem)

source: content
tr: içerik

source: context
tr: İçerik/ Bağlam

source: continue
tr: devam et

source: contrast
tr: karşıtlık

source: contributor
tr: katkıda bulunan

source: control
tr: denetim

source: conversion
tr: dönüştürme

source: convert
tr: dönüştür

source: cookie
tr: kurabiye

source: cooperative
tr: imeceli

source: coordinate
tr: eşgüdümleme

source: copy (noun)
tr: kopya (isim)

source: copy (verb)
tr: kopyala (isim)

source: copy left
tr: sol tarafı kopyala

source: copy right
tr: sağ tarafı kopyala

source: correct
tr: düzelt

source: correspondence
tr: uyuşma

source: correspondent
tr: uyuşan

source: corrupt
tr: bozuk

source: count
tr: say

source: countable
tr: sayılabilir

source: crash
tr: çökme

source: create
tr: oluştur

source: creation
tr: oluşturma

source: criteria
tr: kıstaslar

source: crop
tr: kırp

source: cross-platform
tr: çapraz platformlu

source: crypt
tr: şifrele

source: cryptology
tr: şifreleme bilimi

source: current
tr: mevcut

source: cursor
tr: imleç

source: curve
tr: eğri

source: custom
tr: özel

source: customization
tr: özelleştirme

source: customize
tr: özelleştir

source: cut
tr: kes

source: cycle
tr: döngü

source: daemon
tr: artalan işlemleri

source: damage
tr: hasar

source: data
tr: veri

source: database
tr: veritabanı

source: debug
tr: hata ayıkla

source: debugger
tr: hata ayıklayıcı

source: decimal
tr: ondalık

source: decode
tr: kodu çöz

source: decompress
tr: aç

source: decrease
tr: düşür

source: decrypt
tr: şifreyi aç

source: decryption
tr: şifreyi açma

source: default
tr: varsayılan

source: defect
tr: kusur

source: define
tr: tanımla

source: definition
tr: tanım

source: degree
tr: derece

source: delay
tr: geçiiktir

source: delete
tr: sil

source: deletion
tr: silme

source: delimiter
tr: sınırlandırıcı

source: demo
tr: tanıtım

source: deny
tr: dene

source: dependence
tr: bağımlı

source: dependency
tr: bağımlılık

source: depth
tr: derinlik

source: derived
tr: türetilmiş

source: descending
tr: azalan

source: description
tr: tanımlama

source: deselect
tr: seçimi kaldır

source: design
tr: tasarım

source: desktop
tr: masa üstü

source: destination
tr: alış noktası

source: destroy
tr: sil

source: detach
tr: ayır

source: detect
tr: algıla

source: develop
tr: geliştir

source: development
tr: gelişim

source: developer
tr: geliştirici

source: device
tr: aygıt

source: diagram
tr: çizim

source: dial
tr: çevir

source: dialog
tr: iletişim penceresi, iletişim kutucuğu, pencere, iletişim

source: dialup
tr: çevirmeli bağlantı

source: difference
tr: farklılık

source: digit
tr: basamak, sayı

source: digital
tr: sayısal

source: dimension
tr: boyut

source: directory
tr: dizin

source: disable
tr: kapat

source: disc
tr: disk

source: discard
tr: çıkar

source: disconnect
tr: bağlantıyı kes

source: discussion
tr: tartışma

source: dispatch
tr: dağıt/gönder

source: display
tr: göster/görüntü

source: distort
tr: eğrilt

source: distribute
tr: dağıt

source: distribution
tr: dağıtım

source: distributor
tr: dağıtıcı

source: dock
tr: kilitle

source: document
tr: belge

source: documentation
tr: belge işlem

source: domain
tr: alan

source: double click
tr: çift tıkla

source: download
tr: indir

source: drag
tr: sürükle

source: draw
tr: çiz

source: driver
tr: sürücü

source: dual
tr: ikili

source: dump
tr: döküm

source: duplicate
tr: çoğalt

source: dynamic
tr: devingen

source: echo
tr: yankı

source: edit
tr: düzenle

source: edition
tr: düzenleme

source: editor
tr: düzenleyici

source: effect
tr: uygula

source: eject
tr: çıkar

source: electronic
tr: elektronik

source: element
tr: öge

source: email
tr: eposta

source: embed
tr: katıştır

source: emoticon
tr: yüz ifadesi simgesi

source: empty
tr: boşalt

source: emulate
tr: öykün

source: emulation
tr: öykünme

source: emulator
tr: öykünücü

source: enable
tr: etkinleştir

source: enabled
tr: etkin

source: encode
tr: kodla

source: encoding
tr: kodlama

source: encrypt
tr: şifrele

source: encrypted
tr: şifreli

source: encryption
tr: şifreleme

source: engine
tr: motor

source: enhancement
tr: pekiştirme

source: enlarge
tr: genişlet

source: enlargement
tr: genişletme

source: enter
tr: Enter(tuş)

source: entertainment
tr: eğlence

source: entry
tr: girdi, giriş

source: environment
tr: ortam, çevre

source: equalizer
tr: denkleştirici

source: erase
tr: sil

source: error
tr: hata

source: escape
tr: vazgeç

source: evaluation
tr: değerlendirme

source: event
tr: olay

source: exception
tr: olağandışı durum

source: executable
tr: yürütülebilir

source: execute
tr: yürüt

source: existing
tr: var olan

source: exit
tr: çık

source: expand
tr: genişlet

source: expansion
tr: genişletme

source: explore
tr: araştır

source: export
tr: dışa aktar

source: expression
tr: ifade

source: extend
tr: büyüt

source: extensible
tr: geliştirilebilir

source: extension
tr: uzantı / eklenti

source: external
tr: harici

source: extra
tr: fazladan

source: extract
tr: çıkar

source: fail
tr: başarısız olma

source: fatal
tr: ölümcül

source: fault
tr: arıza

source: favorite
tr: sık kullanılan

source: feature
tr: özellik

source: feed
tr: besle

source: feedback
tr: geri besleme

source: fetch
tr: getir

source: field
tr: alan

source: figure
tr: şekil

source: file
tr: dosya

source: fill
tr: doldur

source: filter
tr: süzgeç

source: find
tr: bul

source: firewall
tr: ateş duvarı

source: firmware
tr: üretici yazılımı

source: fit
tr: uydur

source: fix
tr: onar

source: flag
tr: bayrak

source: flash
tr: yanıp sönsün

source: flat
tr: düz

source: flip
tr: döndür

source: float (verb)
tr: kaydır/yüzdür(fiil)

source: flood
tr: taşma

source: floppy
tr: flopi

source: folder
tr: klasör

source: font
tr: yazı tipi

source: footer
tr: alt bilgi

source: form
tr: form/biçem

source: format (noun)
tr: biçim (isim)

source: format (verb)
tr: biçimlendir

source: formatted
tr: biçimlendirilmiş

source: formula
tr: formül

source: fragment
tr: parça

source: frame
tr: çerçeve

source: frame set
tr: çerçeve kümesi

source: framework
tr: çatı

source: free software
tr: özgür/ücretsiz yazılım

source: freeze
tr: dondur

source: frequency
tr: frekans

source: front end
tr: ön uç

source: function
tr: işlev / fonksiyon

source: gallery
tr: galeri

source: game
tr: oyun

source: gateway
tr: geçit

source: generate
tr: oluştur

source: generation
tr: oluşturma

source: generator
tr: oluşturan

source: generic
tr: soysal

source: geometric
tr: geometrik

source: geometry
tr: geometri

source: grab
tr: kavra/tut

source: gradient
tr: geçişli

source: grain
tr: tane

source: graph
tr: grafik

source: graphic
tr: grafik

source: graphical
tr: grafiksel

source: graphics
tr: grafikler

source: gray-scale
tr: gri ölçeği

source: grid
tr: ızgara

source: group
tr: grup/gruplandır

source: guess
tr: tahmin

source: guest
tr: konuk

source: handle (noun)
tr: tutamak (isim)

source: handle (verb)
tr: işle (eylem)

source: handler
tr: işleyici

source: hardware
tr: donanım

source: hash
tr: kıyım

source: head
tr: başlık

source: header
tr: üst bilgi

source: height
tr: yükseklik

source: help
tr: yardım

source: hide
tr: gizle

source: hierarchy
tr: sıralı dizi

source: high light
tr: vurgula

source: history
tr: geçmiş

source: host
tr: konak

source: hostname
tr: bilgisayar adı

source: hyperlink
tr: köprü

source: hypertext
tr: bağlantılı metin

source: icon
tr: simge

source: identify
tr: tanımla

source: idle
tr: boşta

source: ignore
tr: yoksay

source: image
tr: görüntü, resim

source: implement
tr: uygula

source: import
tr: içe aktar

source: inactive
tr: etkin değil

source: inbox
tr: gelen kutusu

source: inch
tr: inç

source: include
tr: içer

source: incoming
tr: gelen

source: incompatible
tr: bağdaşmayan/uyuşmayan

source: increase
tr: artır

source: increment
tr: birer artır

source: indent
tr: girinti

source: index
tr: dizin/dizinle

source: indice
tr: indis

source: infect
tr: bulaştır

source: infinite
tr: sonsuz

source: information
tr: bilgi

source: infrared
tr: kızılötesi

source: initial
tr: başlangıç

source: initialize
tr: başlat

source: input
tr: girdi/gir

source: insert
tr: ekle

source: install
tr: kur

source: installer
tr: kurucu

source: instance
tr: örnek

source: instruction
tr: yönerge

source: integer
tr: tam sayı

source: integral
tr: integral/tümleşik

source: integrate
tr: tümleştir

source: integration
tr: tümleştirme/integral alma

source: integrity
tr: doğruluk/sağlamlık

source: intensity
tr: yoğunluk

source: interactivity
tr: etkileşim

source: interface
tr: ara yüz

source: internal
tr: dahili

source: interrupt
tr: kes

source: invalid
tr: geçersiz

source: inverse
tr: ters

source: invert
tr: tersine çevir

source: invoke
tr: çalıştır

source: italic
tr: yatık yazı

source: item
tr: öge, madde

source: iteration
tr: yineleme/döngü

source: jag
tr: çentik

source: jam
tr: sıkışma

source: job
tr: iş

source: join
tr: birleştir

source: joy stick
tr: kumanda kolu

source: jump
tr: sıçra

source: junk
tr: önemsiz

source: justify
tr: iki yana hizala

source: keep
tr: koru

source: kernel
tr: kernel/çekirdek

source: key
tr: tuş/anahtar

source: keyboard
tr: tuş takımı, klavye

source: key stroke
tr: tuş vuruşu

source: key word
tr: anahtar sözcük

source: label
tr: etiket, başlık(çalışma sayfasında)

source: landscape
tr: enine/manzara

source: language
tr: dil

source: laptop
tr: diz üstü

source: launch
tr: başlat

source: layer
tr: katman

source: layout
tr: düzen, yerleşim, anahat

source: length
tr: boy, uzunluk

source: license
tr: lisans

source: line
tr: satır/çizgi/hat

source: link
tr: bağlantı

source: list
tr: liste

source: load
tr: yükle

source: local
tr: yerel

source: localization
tr: yerelleştirme

source: location
tr: konum

source: log
tr: sistem günlüğü

source: lookup
tr: ara

source: lower-case
tr: küçük harf

source: machine
tr: makine

source: main board
tr: ana kart

source: maintainer
tr: koruyucu

source: maintenance
tr: bakım

source: manage
tr: yönet

source: management
tr: yönetme

source: manager
tr: yönetici

source: manual
tr: elle/kılavuz

source: margin
tr: kenar boşluğu

source: mark
tr: işaret/işaretle

source: master
tr: ana

source: match
tr: eşleştir

source: maximize
tr: ekranı kapla

source: memory
tr: bellek

source: menu
tr: menü

source: merge
tr: birleştir

source: message
tr: ileti

source: method
tr: yöntem

source: minimize
tr: simge durumuna küçült

source: mode
tr: kip

source: moderator
tr: yönetici

source: modify
tr: değişiklik yap

source: module
tr: birim, modül

source: monitor
tr: izle/ekran

source: mosaic
tr: mozaik

source: motion
tr: hareket

source: mouse
tr: fare

source: move
tr: hareket ettir, kaydır

source: multimedia
tr: çoklu ortam

source: multitasking
tr: çoklu görev

source: name
tr: ad

source: navigation
tr: gezinti

source: navigator
tr: gezgin/kılavuz

source: network
tr: ağ

source: news group
tr: haber grubu

source: next
tr: sonraki

source: nick name
tr: takma ad

source: no
tr: hayır

source: node
tr: düğüm

source: notation
tr: yazım/gösterim

source: note
tr: not, bilgi

source: notebook
tr: diz üstü bilgisayar

source: notification
tr: uyarma

source: notify
tr: uyar

source: null
tr: boş

source: number
tr: numara

source: numbering
tr: numaralandırma

source: object
tr: nesne

source: occurrence
tr: olay

source: octet
tr: sekiz bitli bayt

source: offline
tr: çevrim dışı

source: OK
tr: TAMAM

source: online
tr: çevrim içi

source: ongoing
tr: devam eden

source: opacity
tr: matlık

source: opaque
tr: mat

source: open
tr: aç

source: operation
tr: işlem

source: option
tr: seçenek

source: optional
tr: seçimsel

source: order
tr: sıra/sırala

source: organize
tr: düzenle

source: orientation
tr: yönlendirme

source: original
tr: özgün

source: outgoing
tr: giden

source: output
tr: çıktı

source: overflow
tr: aşım, taşma

source: override
tr: üzerine yaz/geçersiz kıl

source: overwrite
tr: üzerine yaz

source: owner
tr: sahibi

source: pack
tr: paketle

source: package
tr: paket

source: packet
tr: paket

source: padding
tr: doldurma

source: page
tr: sayfa

source: paint
tr: boya

source: pair
tr: çift/çiftle

source: palette
tr: palet

source: panel
tr: pano

source: parallel
tr: paralel

source: parameter
tr: parametre

source: parcel
tr: böl

source: parent
tr: üst/aile

source: parity
tr: parite, eşlik, denklik

source: parse
tr: çözümle/ayrıştır

source: partition
tr: bölümle

source: pass
tr: geç/geçir/geçiş

source: password
tr: parola

source: paste
tr: yapıştır

source: patch (noun)
tr: yama (isim)

source: patch (verb)
tr: yama (eylem)

source: path
tr: yol

source: pattern
tr: desen/örüntü/kalıp

source: pause
tr: duraklat

source: peripheral
tr: çevre birimi

source: permanent
tr: kalıcı

source: permission
tr: izin

source: permutation
tr: permütasyon

source: physical
tr: fiziki

source: picture
tr: resim

source: pipe
tr: boru

source: pixel
tr: piksel, imgecik, benek

source: placement
tr: yerleştirme

source: plain
tr: düz, sade

source: plot (verb)
tr: çizdir (eylem)

source: plotter
tr: çizici

source: plugin
tr: eklenti

source: pop up
tr: açılan

source: port
tr: bağlantı noktası

source: position
tr: konum

source: post
tr: gönder

source: preferences
tr: tercihler, yeğlenenler

source: prepare
tr: hazırla

source: presentation
tr: sunum

source: press
tr: bas

source: prevent
tr: koru

source: preview
tr: ön izle

source: primary
tr: birincil, ana

source: principal
tr: temel, ana

source: print
tr: yazdır

source: printer
tr: yazıcı

source: priority
tr: öncelik

source: privacy
tr: gizlilik

source: private
tr: özel, gizli

source: privilege
tr: ayrıcalık/hak

source: procedure
tr: yöntem/yordam

source: process
tr: işle/işlem

source: processor
tr: işlemci

source: product
tr: ürün

source: profile
tr: profil

source: programmer
tr: programlayıcı

source: project
tr: proje

source: prompt
tr: ekran/anında, dakik/yanıt

source: property
tr: özellik

source: proprietary
tr: özel/kişiye özel/tescilli

source: protect
tr: koru

source: protection
tr: koruma

source: protocol
tr: protokol

source: provide
tr: getir/sağla

source: provider
tr: sağlayıcı, sağlayan

source: proxy
tr: vekil

source: public
tr: açık/ortak/kamu

source: publish
tr: yayımla

source: pull
tr: çek/iste

source: push
tr: it/zorla/gönder

source: quality
tr: kalite, nitelik

source: quantity
tr: miktar, nicelik

source: quarantine
tr: karantinaya al

source: query
tr: sorgu/sorgula

source: queue
tr: kuyruğa al

source: quit
tr: çık

source: quota
tr: kota

source: quotation
tr: kotalandırma/tırnak/alıntı

source: quote
tr: göster/bilgi

source: raise
tr: yükselt

source: random
tr: rastgele

source: range
tr: aralık

source: rate
tr: değer

source: ratio
tr: oran

source: raw
tr: işlem görmemiş

source: ray
tr: ışın

source: read
tr: oku

source: read only
tr: salt okunur

source: ready
tr: hazır

source: real
tr: gerçek

source: reboot
tr: yaniden yükle

source: receipt
tr: alındı bildirimi

source: receive
tr: al

source: recognition
tr: tanıma

source: reconnect
tr: yeniden bağlan

source: record
tr: kayıt

source: record (verb)
tr: kaydet (eylem)

source: recover
tr: kurtar

source: recovery
tr: kurtarma

source: recursion
tr: yineleme

source: recursive
tr: yinelemeli

source: redirect
tr: yeniden yönlendir

source: redo
tr: tekrarla

source: reduce
tr: indirge

source: reduction
tr: indirgeme

source: redundant
tr: artık/yedek

source: reference
tr: başvuru, kaynak

source: referer
tr: başvuran

source: referral
tr: başvuru

source: reflexive
tr: dönüşlü/yansımalı

source: refresh
tr: tazele

source: refuse
tr: reddet

source: regenerate
tr: yeniden oluştur

source: register
tr: kaydol

source: registration
tr: kayıt etme, kaydolma

source: registry
tr: kayıt defteri

source: regular
tr: düzenli

source: regulate
tr: düzenle

source: relay
tr: röle/aktar

source: release
tr: yayın/yayınla

source: remaining
tr: kalan

source: remind
tr: anımsat

source: remote
tr: uzaktan

source: removable
tr: çıkarılabilir/kaldırılabilir

source: remove
tr: çıkar/kaldır/sil

source: rename
tr: yeniden adlandır

source: render
tr: gerçekle

source: renew
tr: yenile

source: repair
tr: onar

source: repeat
tr: yinele

source: replace
tr: değiştir

source: replicate
tr: kopyala, çoğalt

source: replication
tr: kopyalama, çoğaltma

source: reply
tr: yanıtla

source: report
tr: rapor/rapor ver

source: repository
tr: yazılım deposu, yazılım havuzu

source: request
tr: istek/iste

source: require
tr: iste

source: requirement
tr: istek, gereksinizm

source: reset
tr: sıfırla

source: resize
tr: yeniden boyutlandır

source: resolution
tr: çözünürlük

source: resolver
tr: çözücü

source: resource
tr: kaynak

source: response
tr: yanıt ver

source: restart
tr: yeniden başlat

source: restore
tr: eski durumuna getir, geri yükle

source: restrict
tr: kısıtla

source: restriction
tr: kısıtlama

source: result
tr: sonuç/sonuçlandır

source: resume
tr: devam et

source: retrieve
tr: al

source: retry
tr: yeniden dene

source: return
tr: döndür

source: reverse
tr: ters çevir

source: revert
tr: tersine çevir

source: revocation
tr: iptal etme, yürürlükten kaldırma

source: revoke
tr: iptal et

source: root
tr: kök, dizin kökü
